import React from 'react'
import styled from '@emotion/styled'

const StepReady = ({ step }:any) => {

  return <Container step={step}>
    <Code>
      <CodeContent>
        <CodeText>
          <Title>82032</Title>
          <SubTitle>Уникальный номер вашего обращения</SubTitle>
        </CodeText>
        <CodeSeparation></CodeSeparation>
        <CodeText>
          <Title>tv991</Title>
          <SubTitle>Пароль (PIN)</SubTitle>
        </CodeText>
      </CodeContent>

      <Share>
        <ShareButton type='button' aria-label='share telegram'>
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clipPath="url(#clip0_70_537)">
              <path d="M6.29063 0.0890312C5.45156 0.295282 4.72969 0.871845 4.33125 1.65466C4.02656 2.24997 4.01719 2.32497 3.99375 4.25153L3.975 5.99997H3.21563C2.01094 5.99997 1.44844 6.19216 0.820313 6.82028C0.440625 7.19997 0.225 7.57497 0.09375 8.0906C0.0046875 8.43747 0 8.62028 0 12C0 15.3797 0.0046875 15.5625 0.09375 15.9093C0.225 16.425 0.440625 16.8 0.820313 17.1797C1.44844 17.8078 2.01094 18 3.21563 18H3.975L3.99375 19.7484C4.01719 21.6703 4.02656 21.7453 4.33125 22.35C4.62656 22.9359 5.1 23.4 5.69531 23.6906C6.35156 24.0093 6.12188 24 11.9766 24C16.5938 24 17.3016 23.9906 17.6156 23.925C18.5016 23.7468 19.2656 23.1562 19.6781 22.3312C19.9688 21.7547 19.9828 21.6609 20.0016 19.7437L20.025 18H20.7844C21.9938 18 22.5563 17.8078 23.1797 17.1797C23.5594 16.8 23.775 16.4203 23.9062 15.9093C23.9953 15.5625 24 15.3797 24 12C24 8.62028 23.9953 8.43747 23.9062 8.0906C23.775 7.57966 23.5594 7.19997 23.1797 6.82028C22.5563 6.19216 21.9938 5.99997 20.7844 5.99997H20.025L20.0016 4.25153C19.9828 2.32497 19.9688 2.24528 19.6641 1.64528C19.3688 1.06403 18.8766 0.581219 18.3047 0.304657C17.6391 -0.0140934 17.8828 -3.05176e-05 11.9672 0.00465775C7.0125 0.00465775 6.60938 0.0140324 6.29063 0.0890312ZM17.4281 2.10466C17.6531 2.22184 17.8359 2.41403 17.925 2.63434C17.9859 2.77966 18 3.07028 18 4.40622V5.99997H12H6V4.39216C6 2.62028 6.00938 2.56403 6.30938 2.29216C6.62813 2.00153 6.225 2.02028 11.9906 2.01559C17.0813 2.01559 17.2594 2.02028 17.4281 2.10466ZM18 18.0937C18 21.4734 18.0094 21.375 17.7281 21.675C17.6578 21.75 17.5172 21.8484 17.4141 21.8953C17.2359 21.9797 16.9875 21.9843 12.0094 21.9843C6.3 21.9843 6.61875 21.9984 6.30938 21.7125C6.23438 21.6422 6.13594 21.5015 6.08906 21.3984C6.00938 21.2203 6 21.0281 6 18.1031V15H12H18V18.0937Z" fill="#323232"/>
              <path d="M8.48456 16.5516C8.41893 16.5797 8.31581 16.6453 8.25956 16.7016C7.89393 17.0391 7.94081 17.5687 8.35799 17.8781C8.48924 17.9766 8.51268 17.9766 12.0002 17.9766C15.4877 17.9766 15.5111 17.9766 15.6424 17.8781C16.1017 17.5359 16.1017 16.9641 15.6424 16.6219C15.5111 16.5234 15.4783 16.5234 12.0564 16.5141C9.82518 16.5094 8.55956 16.5234 8.48456 16.5516Z" fill="#323232"/>
              <path d="M8.48456 19.5516C8.41893 19.5797 8.31581 19.6453 8.25956 19.7016C7.89393 20.0391 7.94081 20.5687 8.35799 20.8781C8.48924 20.9766 8.51268 20.9766 12.0002 20.9766C15.4877 20.9766 15.5111 20.9766 15.6424 20.8781C16.1017 20.5359 16.1017 19.9641 15.6424 19.6219C15.5111 19.5234 15.4783 19.5234 12.0564 19.5141C9.82518 19.5094 8.55956 19.5234 8.48456 19.5516Z" fill="#323232"/>
            </g>
            <defs>
              <clipPath id="clip0_70_537">
                <rect width="24" height="24" fill="white"/>
              </clipPath>
            </defs>
          </svg>
        </ShareButton>

        <ShareButton type='button' aria-label='share vk'>
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clipPath="url(#clip0_70_536)">
              <path d="M13.7203 1.56074C13.4766 1.64043 13.2375 1.84199 13.1109 2.07637C13.0078 2.26855 13.0078 2.29668 12.9938 4.39199C12.9797 6.35137 12.975 6.51543 12.9 6.51543C12.8578 6.51543 12.5906 6.53887 12.3047 6.5623C8.50781 6.91855 5.05313 8.86387 2.76094 11.9295C1.45781 13.6732 0.628125 15.6514 0.239063 17.9529C0.0703125 18.9279 0.028125 19.5092 0.0234375 20.6482C0.0234375 21.8764 0.028125 21.9045 0.309375 22.1904C0.520313 22.3967 0.698438 22.467 1.0125 22.4717C1.35938 22.4717 1.65469 22.317 1.8375 22.0451C1.90313 21.9467 2.11875 21.6139 2.32031 21.3045C3.58125 19.3592 5.23594 17.7279 6.96094 16.7342C8.58281 15.7967 10.3359 15.3279 12.2109 15.3279H12.9797L12.9938 18.0326L13.0078 20.742L13.125 20.9529C13.1906 21.0654 13.3359 21.2248 13.4438 21.3045C13.6313 21.4311 13.6828 21.4451 14.0109 21.4451C14.3297 21.4451 14.3953 21.4311 14.5594 21.3186C14.6578 21.2482 16.7812 19.1482 19.275 16.6545C24.0563 11.8686 23.9953 11.9342 24 11.5076C24 11.0717 24.0609 11.1373 19.1906 6.27168C16.6641 3.75449 14.5313 1.66387 14.4516 1.62168C14.2406 1.51855 13.9313 1.49043 13.7203 1.56074Z" fill="#323232"/>
            </g>
            <defs>
              <clipPath id="clip0_70_536">
                <rect width="24" height="24" fill="white"/>
              </clipPath>
            </defs>
          </svg>
        </ShareButton>
      </Share>
    </Code>

    <SuccessTitle>
      <Icon>
        <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <g clipPath="url(#clip0_68_460)">
            <path d="M2.52634 0.109182C1.56931 0.360744 0.781813 1.00606 0.355251 1.88653C0.00525052 2.61387 0.0271255 1.77715 0.0271255 14.0545V25.2928L0.174782 25.692C0.552126 26.7365 1.32869 27.5021 2.35134 27.8521L2.70681 27.9725L9.1326 27.9889C15.2849 27.9998 15.5638 27.9998 15.7443 27.9014C16.2146 27.6498 16.2584 26.9771 15.8263 26.6381L15.6787 26.5232H9.57556C5.87322 26.5232 3.32478 26.5014 3.10056 26.4686C2.89822 26.4357 2.62478 26.3592 2.499 26.299C2.16541 26.1295 1.77713 25.6975 1.64041 25.342C1.53103 25.0412 1.53103 25.0303 1.54197 13.9287L1.55838 2.81621L1.70603 2.53184C1.89197 2.18184 2.18181 1.89199 2.54275 1.70059L2.81619 1.5584L10.9482 1.54199L19.0803 1.53106L19.3974 1.6459C19.7967 1.79903 20.2342 2.20371 20.4037 2.58653L20.5349 2.8709L20.5623 9.24199C20.5896 15.2139 20.5951 15.6295 20.6881 15.7662C20.9888 16.2311 21.6724 16.2311 21.9459 15.7662C22.0334 15.6076 22.0388 15.2303 22.0388 9.20371C22.0388 2.12715 22.0607 2.54824 21.6779 1.79356C21.399 1.24121 20.7865 0.634182 20.2342 0.360744C19.4576 -0.0165977 19.9334 -0.000192642 10.992 0.00527573C3.22634 0.00527573 2.90916 0.0107441 2.52634 0.109182Z" fill="#55965B"/>
            <path d="M4.22166 6.67174C3.76229 6.95611 3.78963 7.63424 4.27635 7.92955C4.45135 8.03892 4.56619 8.03892 10.9263 8.03892C17.9701 8.03892 17.642 8.05533 17.8662 7.73267C18.1013 7.39361 18.0521 7.00533 17.7404 6.73189L17.549 6.56236H10.9756C4.47869 6.56236 4.40213 6.56236 4.22166 6.67174Z" fill="#55965B"/>
            <path d="M4.40234 12.4687C4.12891 12.6055 3.99219 12.8242 3.99219 13.125C3.99219 13.4258 4.12891 13.65 4.40234 13.7812C4.62109 13.8851 4.75234 13.8906 8.19219 13.8906C12.0531 13.8906 11.9711 13.8961 12.25 13.5898C12.3648 13.4695 12.3867 13.3875 12.3867 13.125C12.3867 12.8625 12.3648 12.7805 12.25 12.6601C11.9711 12.3539 12.0586 12.3594 8.19219 12.3594C4.73594 12.3594 4.61562 12.3648 4.40234 12.4687Z" fill="#55965B"/>
            <path d="M26.7914 16.067C26.7367 16.0889 25.0359 17.7514 22.9961 19.7639L19.2992 23.4279L17.2922 21.4264C16.1875 20.3272 15.2031 19.3811 15.0992 19.3318C14.6234 19.0912 14 19.4303 13.907 19.9772C13.8359 20.4201 13.8851 20.4803 16.4445 23.0342C18.5062 25.085 18.8726 25.4295 19.075 25.4897C19.5836 25.6373 19.3648 25.8232 23.8273 21.3662C27.4476 17.7404 27.8906 17.2811 27.9453 17.0732C28.0273 16.7615 27.9453 16.4772 27.6992 16.242C27.5351 16.0834 27.4695 16.0561 27.1961 16.0397C27.0211 16.0342 26.8406 16.0451 26.7914 16.067Z" fill="#55965B"/>
          </g>
          <defs>
            <clipPath id="clip0_68_460">
              <rect width="28" height="28" fill="white"/>
            </clipPath>
          </defs>
        </svg>
      </Icon>
      <Text>Ваше обращение отправлено</Text>
    </SuccessTitle>

    <SuccessText>
      <SuccessSubText>После проверки модератором оно будет зарегистрировано и отправлено для рассмотрения ответственному лицу.</SuccessSubText>
      <SuccessSubText>Напоминаем, что в соответствии с Федеральным законом от 02.05.2006 г. №59-ФЗ «О порядке рассмотрения обращений граждан Российской Федерации» письменное обращение, поступившее в государственный орган, орган местного самоуправления или должностному лицу в соответствии с их компетенцией, рассматривается в течение 30 дней со дня регистрации.</SuccessSubText>
    </SuccessText>
  </Container>

}

const Container = styled.div<any>`
    opacity: ${({ step }) => step == 4 ? '1' : '0'};
    position: ${({ step }) => step == 4 ? 'static' : 'absolute'};
    pointer-events: ${({ step }) => step == 4 ? 'auto' : 'none'};
`

const Code = styled.div`
    display: flex;
    flex-direction: row;
    align-items: center;
    gap: 0 40px;
    justify-content: center;
    margin-bottom: 66px;

    @media screen and (max-width: 991px) {
        flex-direction: column;
    }
`

const CodeContent = styled.div`
    padding: 40px;
    background: rgba(233, 231, 228, 0.5);
    border-radius: 16px;
    display: flex;
    flex-direction: row;
    gap: 0 40px;

    @media screen and (max-width: 991px) {
        padding: 0;
    }
`

const Share = styled.div`
    display: flex;
    flex-direction: column;
    gap: 30px 0;
`

const ShareButton = styled.button`
    display: flex;
    justify-content: center;
    align-items: center;
    background: none;
    border: none;

    cursor: pointer;
`

const CodeText = styled.div`
    display: flex;
    flex-direction: column;
    gap: 8px 0;
    max-width: 145px;
`

const Title = styled.p`
    font-weight: 400;
    font-size: 44px;
    line-height: 48px;
    color: #323232;
    margin: 0;
    text-align: center;
`

const SubTitle = styled.p`
    font-weight: 400;
    font-size: 13px;
    line-height: 18px;
    color: #323232;
    margin: 0;
    text-align: center;
`

const CodeSeparation = styled.div`
    width: 1px;
    background-color: #F9F6F3;
`

const SuccessTitle = styled.div`
    display: flex;
    gap: 0 12px;
    margin-bottom: 30px;
    align-items: center;
`

const Icon = styled.div`
    display: flex;
    justify-content: center;
    align-items: center;
`

const Text = styled.p`
    font-weight: 500;
    font-size: 20px;
    line-height: 24px;
    color: #323232;
    margin: 0;
`

const SuccessText = styled.div`
    display: flex;
    flex-direction: column;
    gap: 16px 0;
`

const SuccessSubText = styled.p`
    font-weight: 400;
    font-size: 16px;
    line-height: 24px;
    color: #323232;
    margin: 0;
`

export default StepReady